""" Задание 2. Структуры данных """

def main():
    """ 
        Кнопка «Назад» в браузере:
            стек, т.к. позволяет последовательно шагать назад
            (реализует принцип LIFO)
        Список друзей в соцсети:
            зависит от того, что конкретно нужно хранить.
            если нужно хранить  список друзей конкретного пользователя,
             то скорее всего дерево.
            если нужно хранить вообще глобальных спискок друзей,
             наверное ориентированный граф (направление рёбер указывает
             кто с кем дружит)
            если нужно хранить инфу о том, что с кем в принципе связан,
             то, вероятно, можно использовать неориентированный граф
             для сохранения связей между пользователями
        Сохранения данных пользователя для быстрого доступа: 
            словарь с ключом по ФИО или ID пользователя,
            т.к. позволяет хранить разрозненные данные в
            рамках одной структуры + использование хэш-таблиц позволит 
            получить одинаково быстрый доспу к любому пользователю
            из особенностей хранения - нужно убедиться, что ключ 
            уникален, иначе новая запись перепишет старые данные
            уже существующей записи с таким же ключом
    """

if __name__ == '__main__':
    main()
