"""Задание 2. Система рекомендаций книг"""

LIBRARY = {
        "Гарри Поттер": "фэнтези",
        "Властелин Колец": "фэнтези",
        "Игра Престолов": "фэнтези",
        "Хоббит": "фэнтези",
        "1984": "антиутопия",
        "О дивный новый мир": "антиутопия",
        "451 градус по Фаренгейту": "антиутопия",
        "Мастер и Маргарита": "роман",
        "Война и мир": "роман",
        "Анна Каренина": "роман",
        "Преступление и наказание": "роман",
        "Дюна": "фантастика",
        "Солярис": "фантастика",
        "Пикник на обочине": "фантастика",
        "Шерлок Холмс": "детектив",
        "Убийство в Восточном экспрессе": "детектив",
}

def recomendadtions(likes):
    """ Рекомендует книги из библиотеки"""
    rec_list = []
    genres_list = []
    for title in likes:
        if title in LIBRARY:
            genres_list.append(LIBRARY[title])
    for title, genres in LIBRARY.items():
        if genres in genres_list:
            if title not in likes:
                rec_list.append(title)
    return rec_list

def main():
    """ Основная функция для кинжных рекомендаций """
    user_likes = ["Гарри Поттер", "1984", "Дюна", "Война и мир"]

    recommendations_list = recomendadtions(user_likes)

    print("На основе жанров понравившихся вам книг, можно рекомендовать к прочтению следующие:")
    print(recommendations_list)

if __name__ == '__main__':
    main()
